
int u = 0; // переменная для числа пребразования 0-1023
float u_in = 0.0; // переменная для напряжения

void setup() {
  Serial.begin(9600);
  analogReference(INTERNAL);/* используем внутренний источник опорного 
   напряжения 1.1 В, максимальное входное напрядение на А0 не должно превышать
   напряжение внутреннего ИОН */
  pinMode(A0,INPUT);// A0 - аналоговый вход
}

void loop() {
  Serial.print("U = ");
  u = analogRead(A0); // измерение по входу А0
  u_in = (u * 4.23) / 1023; // пересчет измерения в вольты (на Uвх = 5 В)
  Serial.println(u_in);
  delay(500);
}
